export const MESSAGES = {
  SERVER_ERROR: 'На сервере произошла ошибка',
  URL_ERROR: 'Был запрошен несуществующий роут',
  VALIDATION_ERROR: 'Переданы некорректные данные при создании карточки',
  CARD_NOT_FOUND: 'Карточка с указанным _id не найдена',
  CARD_DELETED: 'Карточка удалена',
  INVALID_CARD_ID: 'Некорректный _id карточки',
  LIKE_ERROR: 'Переданы некорректные данные для постановки/снятия лайка или некорректный _id карточки',
  AVATAR_UPDATE_ERROR: 'Переданы некорректные данные при обновлении аватара',
  USER_UPDATE_ERROR: 'Переданы некорректные данные при обновлении профиля',
  USER_NOT_FOUND: 'Пользователь с указанным _id не найден',
  INVALID_USER_ID: 'Передан некорректный _id пользователя',
  USER_VALIDATION_ERROR: 'Переданы некорректные данные при создании пользователя',
};